/*Задача 3. Дефинирайте и инициализирайте тримерен масив с по 5
елемента (5 x 5 x 5).*/
#include <stdio.h>
int addArray(int balance[5][5][5]){
    for(int i=0;i<5;i++){
        for(int k=0;k<5;k++){
            for(int j=0;j<5;j++){
            printf("Please enter a integer value for [%d][%d][%d] element: \n",i+1,k+1,j+1);
            scanf("%d",&balance[i][k][j]);
            }
        }
       
    }
    printf("You entered:\n");
    for(int i=0;i<5;i++){
        for(int k=0;k<5;k++){
             for(int j=0;j<5;j++){
                printf(" %d ",balance[i][k][j]);
            }
        }
        
        printf("\n");
    }
}
int balance[5][5][5] = {{
			{11, 12, 13,14,15},
			{14, 15, 16,15,15},
			{17, 18, 19,16,18},
			{14, 15, 16,15,17},
			{17, 18, 19,56,56}
		    },
		    {
			{21, 22, 23,16,34},
			{24, 25, 26,32,43},
			{27, 28, 29,78,76},
			{14, 15, 16,35,90},
			{17, 18, 19,12,23}
			},
			{
			{31, 32, 33,45,65},
			{34, 35, 36,32,13},
			{37, 38, 39,43,34},
            {31, 32, 33,45,65},
			{34, 35, 36,32,13}
			},
            {
			{11, 12, 13,14,15},
			{14, 15, 16,15,15},
			{17, 18, 19,16,18},
			{14, 15, 16,15,17},
			{17, 18, 19,56,56}
		    },
            {
			{11, 12, 13,14,15},
			{14, 15, 16,15,15},
			{17, 18, 19,16,18},
			{14, 15, 16,15,17},
			{17, 18, 19,56,56}
		    } ,
                        };
int main(){
    addArray(balance);
    return 0;
}